---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureWAngle
source: html/10ccc711-0858-a86d-d39f-1ee1f903410c.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureWAngle Property

The property labeled "Angle" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureWAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 360".